experiments/bench_results/eval_4k_nobucket_wl_off/run.log
[18:26:00] flagos_whitelist = []
[18:26:00] cleanup old server on 9031
  killed none
[18:26:03] PART A | start vllm serve - no whitelist
[18:26:03] server pid=13578
[18:26:53] waiting 60s bytes=4431
[18:27:53] waiting 120s bytes=14066
[18:28:53] waiting 180s bytes=16291
[18:29:53] waiting 240s bytes=18611
[18:30:53] waiting 300s bytes=19831
[18:31:53] waiting 360s bytes=19956
[18:32:53] waiting 420s bytes=20206
[18:33:13] PART A | READY
[18:33:13] confirmed no WHITELIST env on server
(EngineCore pid=13924) INFO 09-25 18:27:21 [default_loader.py:430] Loading weights took 3.25 seconds
(EngineCore pid=13924) INFO 09-25 18:28:20 [kv_cache_utils.py:2146] GPU KV cache size: 1,205,392 tokens
(EngineCore pid=13924) INFO 09-25 18:28:20 [kv_cache_utils.py:2147] Maximum concurrency for 131,072 tokens per request: 9.20x
[18:33:13] PART B | 4k throughput

RUNS=4
SKIP_FIRST=1
MODEL=/workspace/MiniCPM5-2B
SERVED_MODEL_NAME=minicpm
PORT=9031
ENABLE_ALL=False
TOTAL_CASES=1
TEST_CASES=[(4096, 1024, 64, 256)]

================================================================================
Running: 4096_1024_c64 | Run 1/4
================================================================================
vllm bench serve --backend vllm --model minicpm --tokenizer /workspace/MiniCPM5-2B --endpoint /v1/completions --host localhost --port 9031 --dataset-name random --ignore-eos --random-input-len 4096 --random-output-len 1024 --max-concurrency 64 --num-prompts 256

INFO 09-25 18:33:15 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 09-25 18:33:15 [__init__.py:46] - fl -> vllm_fl:register
INFO 09-25 18:33:15 [__init__.py:58] Loading plugin fl
/opt/conda/envs/mx/lib/python3.12/site-packages/torch/library.py:381: UserWarning: Warning only once for all operators,  other operators may also be overridden.
  Overriding a previously registered kernel for the same operator and the same dispatch key
  operator: _C::cutlass_scaled_mm_supports_fp8(int cuda_device_capability) -> bool
    registered at /tmp/build-via-sdist-_ouj1d45/mcoplib-0.4.5+maca3.7.0.37.torch2.8/op/vllm/torch_bindings.cpp:26
  dispatch key: CompositeImplicitAutograd
  previous kernel: registered at /tmp/build-via-sdist-_ouj1d45/mcoplib-0.4.5+maca3.7.0.37.torch2.8/op/vllm/torch_bindings.cpp:26
       new kernel: registered at /dev/null:95 (Triggered internally at /workspace/framework/mcPytorch/aten/src/ATen/core/dispatch/OperatorEntry.cpp:218.)
  self.m.impl(
INFO Print the version information of mcoplib during compilation.

Version info:Mcoplib_Version = '0.4.5'
Build_Maca_Version = '3.7.0.37'
GIT_BRANCH = 'HEAD'
GIT_COMMIT = 'a9125e4'
Vllm Op Version = 0.20.0
SGlang Op Version  = 0.5.10 

INFO Staring Check the current MACA version of the operating environment.

INFO: Release major.minor matching,  successful:3.7. 

INFO 09-25 18:33:42 [__init__.py:237] Platform plugin fl is activated
/opt/conda/envs/mx/lib/python3.12/site-packages/torchvision/datapoints/__init__.py:12: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
/opt/conda/envs/mx/lib/python3.12/site-packages/torchvision/transforms/v2/__init__.py:54: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f1d5353bb00>, trust_remote_code=False, seed=0, num_prompts=256, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=1024, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='localhost', port=9031, endpoint='/v1/completions', header=None, max_concurrency=64, model='minicpm', input_len=None, output_len=None, tokenizer='/workspace/MiniCPM5-2B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-68470f9f-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-25 18:33:48 [utils.py:90] Sampling input_len from [4095, 4095] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64

  0%|          | 0/256 [00:00<?, ?it/s]
  0%|          | 1/256 [01:25<6:04:49, 85.84s/it]
  1%|          | 2/256 [01:26<2:30:22, 35.52s/it]
  1%|          | 3/256 [01:27<1:23:31, 19.81s/it]
  2%|▏         | 4/256 [01:27<50:46, 12.09s/it]  
  2%|▏         | 5/256 [01:27<32:43,  7.82s/it]
  2%|▏         | 6/256 [01:28<21:51,  5.25s/it]
  3%|▎         | 7/256 [01:28<15:03,  3.63s/it]
  3%|▎         | 8/256 [01:28<10:36,  2.57s/it]
  4%|▎         | 9/256 [01:28<07:38,  1.86s/it]
  4%|▍         | 10/256 [01:29<05:37,  1.37s/it]
  4%|▍         | 11/256 [01:29<04:15,  1.04s/it]
  5%|▍         | 12/256 [01:29<03:18,  1.23it/s]
  5%|▌         | 13/256 [01:30<02:39,  1.52it/s]
  5%|▌         | 14/256 [01:30<02:12,  1.82it/s]
  6%|▌         | 15/256 [01:30<01:53,  2.12it/s]
  6%|▋         | 16/256 [01:30<01:40,  2.39it/s]
  7%|▋         | 17/256 [01:31<01:30,  2.63it/s]
  7%|▋         | 18/256 [01:31<01:24,  2.81it/s]
  7%|▋         | 19/256 [01:31<01:19,  2.96it/s]
  8%|▊         | 20/256 [01:32<01:16,  3.08it/s]
  8%|▊         | 21/256 [01:32<01:14,  3.16it/s]
  9%|▊         | 22/256 [01:32<01:12,  3.23it/s]
  9%|▉         | 23/256 [01:33<01:10,  3.28it/s]
  9%|▉         | 24/256 [01:33<01:09,  3.32it/s]
 10%|▉         | 25/256 [01:33<01:08,  3.35it/s]
 10%|█         | 26/256 [01:33<01:08,  3.37it/s]
 11%|█         | 27/256 [01:34<01:07,  3.37it/s]
 11%|█         | 28/256 [01:34<01:07,  3.39it/s]
 11%|█▏        | 29/256 [01:34<01:06,  3.39it/s]
 12%|█▏        | 30/256 [01:35<01:06,  3.40it/s]
 12%|█▏        | 31/256 [01:35<01:06,  3.39it/s]
 12%|█▎        | 32/256 [01:35<01:06,  3.39it/s]
 13%|█▎        | 33/256 [01:35<01:05,  3.39it/s]
 13%|█▎        | 34/256 [01:36<01:05,  3.38it/s]
 14%|█▎        | 35/256 [01:36<01:18,  2.81it/s]
 14%|█▍        | 36/256 [01:36<01:11,  3.08it/s]
 14%|█▍        | 37/256 [01:37<01:06,  3.29it/s]
 15%|█▍        | 38/256 [01:37<01:02,  3.46it/s]
 15%|█▌        | 39/256 [01:37<01:02,  3.45it/s]
 16%|█▌        | 40/256 [01:38<01:02,  3.44it/s]
 16%|█▌        | 41/256 [01:38<01:02,  3.44it/s]
 16%|█▋        | 42/256 [01:38<01:02,  3.44it/s]
 17%|█▋        | 43/256 [01:38<01:02,  3.43it/s]
 17%|█▋        | 44/256 [01:39<01:01,  3.44it/s]
 18%|█▊        | 45/256 [01:39<01:01,  3.43it/s]
 18%|█▊        | 46/256 [01:39<01:10,  2.96it/s]
 18%|█▊        | 47/256 [01:40<01:07,  3.08it/s]
 19%|█▉        | 48/256 [01:40<01:05,  3.17it/s]
 19%|█▉        | 49/256 [01:40<01:03,  3.24it/s]
 20%|█▉        | 50/256 [01:41<01:02,  3.29it/s]
 20%|█▉        | 51/256 [01:41<01:01,  3.32it/s]
 20%|██        | 52/256 [01:41<01:01,  3.34it/s]
 21%|██        | 53/256 [01:42<01:00,  3.38it/s]
 21%|██        | 54/256 [01:42<00:59,  3.40it/s]
 21%|██▏       | 55/256 [01:42<00:58,  3.41it/s]
 22%|██▏       | 56/256 [01:42<00:58,  3.41it/s]
 22%|██▏       | 57/256 [01:43<00:58,  3.42it/s]
 23%|██▎       | 58/256 [01:43<00:57,  3.43it/s]
 23%|██▎       | 59/256 [01:43<00:57,  3.43it/s]
 23%|██▎       | 60/256 [01:44<00:57,  3.44it/s]
 24%|██▍       | 61/256 [01:44<00:56,  3.42it/s]
 24%|██▍       | 62/256 [01:44<00:56,  3.43it/s]
 25%|██▍       | 63/256 [01:44<00:56,  3.43it/s]
 25%|██▌       | 64/256 [01:45<00:56,  3.42it/s]
 25%|██▌       | 65/256 [02:28<41:42, 13.10s/it]
 26%|██▌       | 66/256 [02:28<29:19,  9.26s/it]
 26%|██▌       | 67/256 [02:28<20:37,  6.55s/it]
 27%|██▋       | 68/256 [02:28<14:35,  4.66s/it]
 27%|██▋       | 69/256 [02:29<10:24,  3.34s/it]
 27%|██▋       | 70/256 [02:29<07:30,  2.42s/it]
 28%|██▊       | 71/256 [02:29<05:30,  1.78s/it]
 28%|██▊       | 72/256 [02:30<04:05,  1.34s/it]
 29%|██▊       | 73/256 [02:30<03:07,  1.02s/it]
 29%|██▉       | 74/256 [02:30<02:26,  1.25it/s]
 29%|██▉       | 75/256 [02:31<01:57,  1.54it/s]
 30%|██▉       | 76/256 [02:31<01:37,  1.84it/s]
 30%|███       | 77/256 [02:31<01:23,  2.14it/s]
 30%|███       | 78/256 [02:31<01:13,  2.41it/s]
 31%|███       | 79/256 [02:32<01:06,  2.65it/s]
 31%|███▏      | 80/256 [02:32<01:01,  2.84it/s]
 32%|███▏      | 81/256 [02:32<00:58,  3.00it/s]
 32%|███▏      | 82/256 [02:33<01:04,  2.71it/s]
 32%|███▏      | 83/256 [02:33<01:14,  2.32it/s]
 33%|███▎      | 84/256 [02:34<01:04,  2.65it/s]
 33%|███▎      | 85/256 [02:34<00:58,  2.94it/s]
 34%|███▎      | 86/256 [02:34<00:54,  3.10it/s]
 34%|███▍      | 87/256 [02:34<00:53,  3.17it/s]
 34%|███▍      | 88/256 [02:35<00:52,  3.23it/s]
 35%|███▍      | 89/256 [02:35<00:51,  3.27it/s]
 35%|███▌      | 90/256 [02:35<00:50,  3.30it/s]
 36%|███▌      | 91/256 [02:36<00:49,  3.31it/s]
 36%|███▌      | 92/256 [02:36<00:49,  3.32it/s]
 36%|███▋      | 93/256 [02:36<00:48,  3.33it/s]
 37%|███▋      | 94/256 [02:36<00:48,  3.34it/s]
 37%|███▋      | 95/256 [02:37<00:48,  3.34it/s]
 38%|███▊      | 96/256 [02:37<00:47,  3.34it/s]
 38%|███▊      | 97/256 [02:37<00:47,  3.35it/s]
 38%|███▊      | 98/256 [02:38<00:54,  2.87it/s]
 39%|███▊      | 99/256 [02:38<00:52,  3.01it/s]
 39%|███▉      | 100/256 [02:38<00:49,  3.13it/s]
 39%|███▉      | 101/256 [02:39<00:48,  3.19it/s]
 40%|███▉      | 102/256 [02:39<00:47,  3.25it/s]
 40%|████      | 103/256 [02:39<00:46,  3.28it/s]
 41%|████      | 104/256 [02:40<00:45,  3.31it/s]
 41%|████      | 105/256 [02:40<00:45,  3.33it/s]
 41%|████▏     | 106/256 [02:40<00:44,  3.34it/s]
 42%|████▏     | 107/256 [02:40<00:44,  3.34it/s]
 42%|████▏     | 108/256 [02:41<00:44,  3.34it/s]
 43%|████▎     | 109/256 [02:41<00:43,  3.35it/s]
 43%|████▎     | 110/256 [02:41<00:43,  3.34it/s]
 43%|████▎     | 111/256 [02:42<00:43,  3.35it/s]
 44%|████▍     | 112/256 [02:42<00:43,  3.35it/s]
 44%|████▍     | 113/256 [02:42<00:42,  3.36it/s]
 45%|████▍     | 114/256 [02:43<00:49,  2.87it/s]
 45%|████▍     | 115/256 [02:43<00:46,  3.02it/s]
 45%|████▌     | 116/256 [02:43<00:44,  3.13it/s]
 46%|████▌     | 117/256 [02:44<00:43,  3.21it/s]
 46%|████▌     | 118/256 [02:44<00:42,  3.26it/s]
 46%|████▋     | 119/256 [02:44<00:41,  3.29it/s]
 47%|████▋     | 120/256 [02:45<00:41,  3.31it/s]
 47%|████▋     | 121/256 [02:45<00:40,  3.34it/s]
 48%|████▊     | 122/256 [02:45<00:40,  3.35it/s]
 48%|████▊     | 123/256 [02:45<00:39,  3.36it/s]
 48%|████▊     | 124/256 [02:46<00:39,  3.36it/s]
 49%|████▉     | 125/256 [02:46<00:38,  3.36it/s]
 49%|████▉     | 126/256 [02:46<00:38,  3.36it/s]
 50%|████▉     | 127/256 [02:47<00:38,  3.36it/s]
 50%|█████     | 128/256 [02:47<00:38,  3.36it/s]
 50%|█████     | 129/256 [03:30<27:32, 13.01s/it]
 51%|█████     | 130/256 [03:30<19:19,  9.20s/it]
 51%|█████     | 131/256 [03:30<13:33,  6.50s/it]
 52%|█████▏    | 132/256 [03:30<09:33,  4.63s/it]
 52%|█████▏    | 133/256 [03:31<06:48,  3.32s/it]
 52%|█████▏    | 134/256 [03:31<04:54,  2.41s/it]
 53%|█████▎    | 135/256 [03:31<03:35,  1.78s/it]
 53%|█████▎    | 136/256 [03:31<02:40,  1.33s/it]
 54%|█████▎    | 137/256 [03:32<02:01,  1.02s/it]
 54%|█████▍    | 138/256 [03:32<01:34,  1.24it/s]
 54%|█████▍    | 139/256 [03:32<01:16,  1.53it/s]
 55%|█████▍    | 140/256 [03:33<01:03,  1.84it/s]
 55%|█████▌    | 141/256 [03:33<00:54,  2.13it/s]
 55%|█████▌    | 142/256 [03:33<00:47,  2.39it/s]
 56%|█████▌    | 143/256 [03:34<00:43,  2.62it/s]
 56%|█████▋    | 144/256 [03:34<00:39,  2.81it/s]
 57%|█████▋    | 145/256 [03:34<00:37,  2.96it/s]
 57%|█████▋    | 146/256 [03:35<00:41,  2.67it/s]
 57%|█████▋    | 147/256 [03:35<00:38,  2.86it/s]
 58%|█████▊    | 148/256 [03:35<00:35,  3.01it/s]
 58%|█████▊    | 149/256 [03:35<00:34,  3.11it/s]
 59%|█████▊    | 150/256 [03:36<00:33,  3.19it/s]
 59%|█████▉    | 151/256 [03:36<00:32,  3.25it/s]
 59%|█████▉    | 152/256 [03:36<00:31,  3.30it/s]
 60%|█████▉    | 153/256 [03:37<00:30,  3.33it/s]
 60%|██████    | 154/256 [03:37<00:30,  3.35it/s]
 61%|██████    | 155/256 [03:37<00:30,  3.36it/s]
 61%|██████    | 156/256 [03:38<00:29,  3.37it/s]
 61%|██████▏   | 157/256 [03:38<00:29,  3.37it/s]
 62%|██████▏   | 158/256 [03:38<00:29,  3.37it/s]
 62%|██████▏   | 159/256 [03:38<00:28,  3.37it/s]
 62%|██████▎   | 160/256 [03:39<00:28,  3.37it/s]
 63%|██████▎   | 161/256 [03:39<00:28,  3.38it/s]
 63%|██████▎   | 162/256 [03:39<00:32,  2.89it/s]
 64%|██████▎   | 163/256 [03:40<00:30,  3.04it/s]
 64%|██████▍   | 164/256 [03:40<00:29,  3.16it/s]
 64%|██████▍   | 165/256 [03:40<00:28,  3.23it/s]
 65%|██████▍   | 166/256 [03:41<00:27,  3.28it/s]
 65%|██████▌   | 167/256 [03:41<00:26,  3.32it/s]
 66%|██████▌   | 168/256 [03:41<00:26,  3.34it/s]
 66%|██████▌   | 169/256 [03:42<00:25,  3.36it/s]
 66%|██████▋   | 170/256 [03:42<00:25,  3.38it/s]
 67%|██████▋   | 171/256 [03:42<00:25,  3.38it/s]
 67%|██████▋   | 172/256 [03:42<00:24,  3.38it/s]
 68%|██████▊   | 173/256 [03:43<00:24,  3.39it/s]
 68%|██████▊   | 174/256 [03:43<00:24,  3.39it/s]
 68%|██████▊   | 175/256 [03:43<00:23,  3.39it/s]
 69%|██████▉   | 176/256 [03:44<00:23,  3.39it/s]
 69%|██████▉   | 177/256 [03:44<00:23,  3.39it/s]
 70%|██████▉   | 178/256 [03:44<00:26,  2.91it/s]
 70%|██████▉   | 179/256 [03:45<00:25,  3.05it/s]
 70%|███████   | 180/256 [03:45<00:24,  3.16it/s]
 71%|███████   | 181/256 [03:45<00:23,  3.24it/s]
 71%|███████   | 182/256 [03:46<00:22,  3.29it/s]
 71%|███████▏  | 183/256 [03:46<00:21,  3.33it/s]
 72%|███████▏  | 184/256 [03:46<00:21,  3.35it/s]
 72%|███████▏  | 185/256 [03:46<00:21,  3.37it/s]
 73%|███████▎  | 186/256 [03:47<00:20,  3.39it/s]
 73%|███████▎  | 187/256 [03:47<00:20,  3.39it/s]
 73%|███████▎  | 188/256 [03:47<00:20,  3.39it/s]
 74%|███████▍  | 189/256 [03:48<00:19,  3.40it/s]
 74%|███████▍  | 190/256 [03:48<00:19,  3.40it/s]
 75%|███████▍  | 191/256 [03:48<00:22,  2.89it/s]
 75%|███████▌  | 192/256 [03:48<00:18,  3.46it/s]
 75%|███████▌  | 193/256 [04:32<13:46, 13.12s/it]
 76%|███████▌  | 194/256 [04:32<09:31,  9.22s/it]
 76%|███████▌  | 195/256 [04:32<06:37,  6.52s/it]
 77%|███████▋  | 197/256 [04:32<03:30,  3.57s/it]
 78%|███████▊  | 199/256 [04:32<02:04,  2.19s/it]
 79%|███████▊  | 201/256 [04:33<01:18,  1.43s/it]
 79%|███████▉  | 203/256 [04:33<00:51,  1.03it/s]
 80%|████████  | 205/256 [04:33<00:34,  1.47it/s]
 81%|████████  | 207/256 [04:33<00:23,  2.05it/s]
 82%|████████▏ | 209/256 [04:33<00:17,  2.65it/s]
 82%|████████▏ | 210/256 [04:33<00:15,  3.04it/s]
 83%|████████▎ | 212/256 [04:34<00:10,  4.13it/s]
 84%|████████▎ | 214/256 [04:34<00:07,  5.36it/s]
 84%|████████▍ | 216/256 [04:34<00:06,  6.66it/s]
 85%|████████▌ | 218/256 [04:34<00:04,  8.04it/s]
 86%|████████▌ | 220/256 [04:34<00:03,  9.44it/s]
 87%|████████▋ | 222/256 [04:34<00:03, 10.76it/s]
 88%|████████▊ | 224/256 [04:35<00:05,  6.22it/s]
 88%|████████▊ | 226/256 [04:36<00:06,  4.44it/s]
 89%|████████▉ | 228/256 [04:36<00:04,  5.80it/s]
 90%|████████▉ | 230/256 [04:36<00:03,  7.35it/s]
 91%|█████████ | 233/256 [04:36<00:02,  9.88it/s]
 92%|█████████▏| 236/256 [04:36<00:01, 12.39it/s]
 93%|█████████▎| 239/256 [04:36<00:01, 14.81it/s]
 94%|█████████▍| 241/256 [04:37<00:02,  6.49it/s]
 95%|█████████▌| 244/256 [04:37<00:01,  8.73it/s]
 97%|█████████▋| 248/256 [04:38<00:00,  8.38it/s]
 98%|█████████▊| 252/256 [04:38<00:00,  7.51it/s]
 99%|█████████▉| 254/256 [04:39<00:00,  6.71it/s]
100%|██████████| 256/256 [04:40<00:00,  4.75it/s]
100%|██████████| 256/256 [04:40<00:00,  1.09s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     256       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  280.07    
Total input tokens:                      1048576   
Total generated tokens:                  262144    
Request throughput (req/s):              0.91      
Output token throughput (tok/s):         935.99    
Peak output token throughput (tok/s):    1408.00   
Peak concurrent requests:                68.00     
Total token throughput (tok/s):          4679.96   
---------------Time to First Token----------------
Mean TTFT (ms):                          8123.34   
Median TTFT (ms):                        753.09    
P99 TTFT (ms):                           40450.08  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          59.39     
Median TPOT (ms):                        59.60     
P99 TPOT (ms):                           67.63     
---------------Inter-token Latency----------------
Mean ITL (ms):                           59.39     
Median ITL (ms):                         47.07     
P99 ITL (ms):                            157.09    
==================================================

================================================================================
Running: 4096_1024_c64 | Run 2/4
================================================================================
vllm bench serve --backend vllm --model minicpm --tokenizer /workspace/MiniCPM5-2B --endpoint /v1/completions --host localhost --port 9031 --dataset-name random --ignore-eos --random-input-len 4096 --random-output-len 1024 --max-concurrency 64 --num-prompts 256

INFO 09-25 18:38:57 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 09-25 18:38:57 [__init__.py:46] - fl -> vllm_fl:register
INFO 09-25 18:38:57 [__init__.py:58] Loading plugin fl
/opt/conda/envs/mx/lib/python3.12/site-packages/torch/library.py:381: UserWarning: Warning only once for all operators,  other operators may also be overridden.
  Overriding a previously registered kernel for the same operator and the same dispatch key
  operator: _C::cutlass_scaled_mm_supports_fp8(int cuda_device_capability) -> bool
    registered at /tmp/build-via-sdist-_ouj1d45/mcoplib-0.4.5+maca3.7.0.37.torch2.8/op/vllm/torch_bindings.cpp:26
  dispatch key: CompositeImplicitAutograd
  previous kernel: registered at /tmp/build-via-sdist-_ouj1d45/mcoplib-0.4.5+maca3.7.0.37.torch2.8/op/vllm/torch_bindings.cpp:26
       new kernel: registered at /dev/null:95 (Triggered internally at /workspace/framework/mcPytorch/aten/src/ATen/core/dispatch/OperatorEntry.cpp:218.)
  self.m.impl(
INFO Print the version information of mcoplib during compilation.

Version info:Mcoplib_Version = '0.4.5'
Build_Maca_Version = '3.7.0.37'
GIT_BRANCH = 'HEAD'
GIT_COMMIT = 'a9125e4'
Vllm Op Version = 0.20.0
SGlang Op Version  = 0.5.10 

INFO Staring Check the current MACA version of the operating environment.

INFO: Release major.minor matching,  successful:3.7. 

INFO 09-25 18:39:24 [__init__.py:237] Platform plugin fl is activated
/opt/conda/envs/mx/lib/python3.12/site-packages/torchvision/datapoints/__init__.py:12: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
/opt/conda/envs/mx/lib/python3.12/site-packages/torchvision/transforms/v2/__init__.py:54: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f6252d67b00>, trust_remote_code=False, seed=0, num_prompts=256, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=1024, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='localhost', port=9031, endpoint='/v1/completions', header=None, max_concurrency=64, model='minicpm', input_len=None, output_len=None, tokenizer='/workspace/MiniCPM5-2B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-eb32b689-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-25 18:39:30 [utils.py:90] Sampling input_len from [4095, 4095] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64

  0%|          | 0/256 [00:00<?, ?it/s]
  0%|          | 1/256 [00:59<4:12:14, 59.35s/it]
  1%|          | 2/256 [00:59<1:44:14, 24.62s/it]
  1%|          | 3/256 [00:59<56:49, 13.47s/it]  
  2%|▏         | 4/256 [01:00<34:40,  8.26s/it]
  2%|▏         | 5/256 [01:00<22:28,  5.37s/it]
  2%|▏         | 6/256 [01:00<15:10,  3.64s/it]
  3%|▎         | 7/256 [01:00<10:34,  2.55s/it]
  3%|▎         | 8/256 [01:01<07:33,  1.83s/it]
  4%|▎         | 9/256 [01:01<05:32,  1.35s/it]
  4%|▍         | 10/256 [01:01<04:11,  1.02s/it]
  4%|▍         | 11/256 [01:02<03:15,  1.25it/s]
  5%|▍         | 12/256 [01:02<02:37,  1.55it/s]
  5%|▌         | 13/256 [01:02<02:10,  1.86it/s]
  5%|▌         | 14/256 [01:02<01:49,  2.21it/s]
  6%|▌         | 15/256 [01:03<01:34,  2.55it/s]
  6%|▋         | 16/256 [01:03<01:24,  2.85it/s]
  7%|▋         | 17/256 [01:03<01:19,  2.99it/s]
  7%|▋         | 18/256 [01:04<01:16,  3.11it/s]
  7%|▋         | 19/256 [01:04<01:14,  3.19it/s]
  8%|▊         | 20/256 [01:04<01:12,  3.25it/s]
  8%|▊         | 21/256 [01:04<01:11,  3.29it/s]
  9%|▊         | 22/256 [01:05<01:10,  3.32it/s]
  9%|▉         | 23/256 [01:05<01:09,  3.34it/s]
  9%|▉         | 24/256 [01:05<01:09,  3.34it/s]
 10%|▉         | 25/256 [01:06<01:08,  3.35it/s]
 10%|█         | 26/256 [01:06<01:08,  3.36it/s]
 11%|█         | 27/256 [01:06<01:08,  3.36it/s]
 11%|█         | 28/256 [01:07<01:07,  3.37it/s]
 11%|█▏        | 29/256 [01:07<01:07,  3.37it/s]
 12%|█▏        | 30/256 [01:07<01:06,  3.37it/s]
 12%|█▏        | 31/256 [01:07<01:06,  3.37it/s]
 12%|█▎        | 32/256 [01:08<01:06,  3.37it/s]
 13%|█▎        | 33/256 [01:08<01:06,  3.37it/s]
 13%|█▎        | 34/256 [01:08<01:05,  3.38it/s]
 14%|█▎        | 35/256 [01:09<01:05,  3.39it/s]
 14%|█▍        | 36/256 [01:09<01:04,  3.39it/s]
 14%|█▍        | 37/256 [01:09<01:04,  3.40it/s]
 15%|█▍        | 38/256 [01:09<01:04,  3.39it/s]
 15%|█▌        | 39/256 [01:10<01:04,  3.38it/s]
 16%|█▌        | 40/256 [01:10<01:03,  3.38it/s]
 16%|█▌        | 41/256 [01:10<01:03,  3.39it/s]
 16%|█▋        | 42/256 [01:11<01:03,  3.38it/s]
 17%|█▋        | 43/256 [01:11<01:03,  3.38it/s]
 17%|█▋        | 44/256 [01:11<01:02,  3.38it/s]
 18%|█▊        | 45/256 [01:12<01:02,  3.37it/s]
 18%|█▊        | 46/256 [01:12<01:10,  2.96it/s]
 18%|█▊        | 47/256 [01:12<01:07,  3.07it/s]
 19%|█▉        | 48/256 [01:13<01:05,  3.16it/s]
 19%|█▉        | 49/256 [01:13<01:04,  3.22it/s]
 20%|█▉        | 50/256 [01:13<01:03,  3.27it/s]
 20%|█▉        | 51/256 [01:13<01:01,  3.31it/s]
 20%|██        | 52/256 [01:14<01:01,  3.33it/s]
 21%|██        | 53/256 [01:14<01:00,  3.36it/s]
 21%|██        | 54/256 [01:14<00:59,  3.37it/s]
 21%|██▏       | 55/256 [01:15<00:59,  3.37it/s]
 22%|██▏       | 56/256 [01:15<00:59,  3.38it/s]
 22%|██▏       | 57/256 [01:15<00:58,  3.39it/s]
 23%|██▎       | 58/256 [01:16<00:58,  3.39it/s]
 23%|██▎       | 59/256 [01:16<00:58,  3.39it/s]
 23%|██▎       | 60/256 [01:16<00:57,  3.40it/s]
 24%|██▍       | 61/256 [01:16<00:57,  3.40it/s]
 24%|██▍       | 62/256 [01:17<00:57,  3.39it/s]
 25%|██▍       | 63/256 [01:17<00:56,  3.39it/s]
 25%|██▌       | 64/256 [01:17<00:56,  3.42it/s]
 25%|██▌       | 65/256 [01:42<23:53,  7.51s/it]
 76%|███████▌  | 194/256 [01:42<00:08,  7.44it/s]
100%|██████████| 256/256 [01:42<00:00,  2.50it/s]
Failed requests during benchmark run detected (capping to 10):
Error 0: Internal Server Error
Error 1: Internal Server Error
Error 2: Internal Server Error
Error 3: Internal Server Error
Error 4: Internal Server Error
Error 5: Internal Server Error
Error 6: Internal Server Error
Error 7: Internal Server Error
Error 8: Internal Server Error
Error 9: Internal Server Error
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         128       
Maximum request concurrency:             64        
Benchmark duration (s):                  102.32    
Total input tokens:                      524224    
Total generated tokens:                  93829     
Request throughput (req/s):              1.25      
Output token throughput (tok/s):         917.03    
Peak output token throughput (tok/s):    1408.00   
Peak concurrent requests:                68.00     
Total token throughput (tok/s):          6040.47   
---------------Time to First Token----------------
Mean TTFT (ms):                          4740.53   
Median TTFT (ms):                        1023.91   
P99 TTFT (ms):                           16829.95  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          86.65     
Median TPOT (ms):                        59.03     
P99 TPOT (ms):                           588.98    
---------------Inter-token Latency----------------
Mean ITL (ms):                           59.88     
Median ITL (ms):                         46.92     
P99 ITL (ms):                            157.11    
==================================================

================================================================================
Running: 4096_1024_c64 | Run 3/4
================================================================================
vllm bench serve --backend vllm --model minicpm --tokenizer /workspace/MiniCPM5-2B --endpoint /v1/completions --host localhost --port 9031 --dataset-name random --ignore-eos --random-input-len 4096 --random-output-len 1024 --max-concurrency 64 --num-prompts 256